Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/design-principles_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: design-principles title: Design Principles layout: contributing permalink: docs/design-principles.html prev: implementation-notes.html redirect_from:
ja: --- id: design-principles title: 設計原則 layout: contributing permalink: docs/design-principles.html prev: implementation-notes.html redirect_from:

source: We wrote this document so that you have a better idea of how we decide what React does and what React doesn't do, and what our development philosophy is like.
ja: このドキュメントを作成したのは、React が何をして何をしないのか、そして開発理念がどのようなものなのかをより理解できるようにするためです。

source: While we are excited to see community contributions, we are not likely to choose a path that violates one or more of these principles.
ja: 私たちはコミュニティへの貢献を見ることにわくわくしています。しかしこれらの原則の 1 つ以上に違反する道を選ぶことはありません。

source: >**Note:** > >This document assumes a strong understanding of React.
ja: >**注意:** > >このドキュメントは React を強く理解していることを前提としています。

source: It describes the design principles of *React itself*, not React components or applications.
ja: React のコンポーネントやアプリケーションではなく、*React 自体*の設計原則について説明しています。

source: > >For an introduction to React, check out [Thinking in React](/docs/thinking-in-react.html) instead.
ja: > >React の紹介については、代わりに [React の流儀](/docs/thinking-in-react.html)を調べてください。

source: ### Composition {#composition}
ja: ### コンポジション {#composition}

source: The key feature of React is composition of components.
ja: React の主な機能はコンポーネントのコンポジションです。

source: Components written by different people should work well together.
ja: 異なる人々によって書かれたコンポーネントは一緒にうまく動くべきです。

source: It is important to us that you can add functionality to a component without causing rippling changes throughout the codebase.
ja: コードベース全体に波及する変更を引き起こすことなく、コンポーネントに機能を追加できるということが重要です。

source: For example, it should be possible to introduce some local state into a component without changing any of the components using it.
ja: たとえば、コンポーネントを使用する側を変更せずに、コンポーネントにローカル state を導入することが可能であるべきです。

source: Similarly, it should be possible to add some initialization and teardown code to any component when necessary.
ja: 同様に、必要に応じて初期化と終了処理を任意のコンポーネントに追加できるべきです。

source: There is nothing "bad" about using state or lifecycle methods in components.
ja: コンポーネントで state またはライフサイクルメソッドを使用することについて「悪い」ことは何もありません。

source: Like any powerful feature, they should be used in moderation, but we have no intention to remove them.
ja: 他の強力な機能と同様に適度に使用する必要がありますが、私たちはそれらを削除するつもりはありません。

source: On the contrary, we think they are integral parts of what makes React useful.
ja: それどころか、それらは React を有用にするものとして不可欠な部分であると思います。

source: We might enable [more functional patterns](https://github.com/reactjs/react-future/tree/master/07%20-%20Returning%20State) in the future, but both local state and lifecycle methods will be a part of that model.
ja: 将来的には[より関数型的なパターン](https://github.com/reactjs/react-future/tree/master/07%20-%20Returning%20State)を使用可能にするかもしれませんが、ローカルステートとライフサイクルメソッドの両方がそのモデルの一部になるでしょう。

source: Components are often described as "just functions" but in our view they need to be more than that to be useful.
ja: コンポーネントはしばしば「単なる関数」と表現されますが、私たちの見解では、それらは有用であるために単なる関数以上である必要があります。

source: In React, components describe any composable behavior, and this includes rendering, lifecycle, and state.
ja: React では、コンポーネントは組み合わせ可能な動作を記述します。そしてこれには、レンダリング、ライフサイクル、および state が含まれます。

source: Some external libraries like [Relay](https://facebook.github.io/relay/) augment components with other responsibilities such as describing data dependencies.
ja: [Relay](https://facebook.github.io/relay/) のようないくつかの外部ライブラリは、データの依存関係を記述するといったような他の責任をコンポーネントに付け加えます。

source: It is possible that those ideas might make it back into React too in some form.
ja: それらのアイデアが何らかの形で React に改めて取り込まれるということも有り得ます。

source: ### Common Abstraction {#common-abstraction}
ja: ### 共通の抽象化 {#common-abstraction}

source: In general we [resist adding features](https://www.youtube.com/watch?v=4anAwXYqLG8) that can be implemented in userland.
ja: 一般的に私たちはユーザ側で実装できる[機能の追加をできるだけ避けます](https://www.youtube.com/watch?v=4anAwXYqLG8)。

source: We don't want to bloat your apps with useless library code.
ja: 使用されない無駄なライブラリコードであなたのアプリを肥大化させたくありません。

source: However, there are exceptions to this.
ja: ただし、これには例外があります。

source: For example, if React didn't provide support for local state or lifecycle methods, people would create custom abstractions for them.
ja: たとえば、もし React がローカル state やライフサイクルメソッドをサポートしなかったなら、人々はそれらに対して独自の抽象化を作成したことでしょう。

source: When there are multiple abstractions competing, React can't enforce or take advantage of the properties of either of them.
ja: 複数の抽象化が競合している場合、React はどちらかの利用を勧めたりどちらか一方のみにある特性を利用したりすることができなくなります。

source: It has to work with the lowest common denominator.
ja: 最小公倍数の機能でやっていかなければならないのです。

source: This is why sometimes we add features to React itself.
ja: これが、React 自体に機能を追加することがある理由です。

source: If we notice that many components implement a certain feature in incompatible or inefficient ways, we might prefer to bake it into React.
ja: 多くのコンポーネントが互換性のない、または非効率的な方法で特定の機能を実装していることに気づいたら、React にそれを織り込むかもしれません。

source: We don't do it lightly.
ja: しかし私たちは気軽にはそれをしません。

source: When we do it, it's because we are confident that raising the abstraction level benefits the whole ecosystem.
ja: それをするときは抽象化レベルを上げることがエコシステム全体に利益をもたらすと確信しているからです。

source: State, lifecycle methods, cross-browser event normalization are good examples of this.
ja: state、ライフサイクルメソッド、クロスブラウザのイベント正規化などがその好例です。

source: We always discuss such improvement proposals with the community.
ja: 私たちは常にそのような改善提案をコミュニティーと話し合います。

source: You can find some of those discussions by the ["big picture"](https://github.com/facebook/react/issues?q=is:open+is:issue+label:"Type:+Big+Picture") label on the React issue tracker.
ja: それらの議論のいくつかは React イシュートラッカーの ["big picture"](https://github.com/facebook/react/issues?q=is:open+is:issue+label:"Type:+Big+Picture") ラベルで見つけることができます。

source: ### Escape Hatches {#escape-hatches}
ja: ### 避難ハッチ {#escape-hatches}

source: React is pragmatic.
ja: React は実用主義的です。

source: It is driven by the needs of the products written at Facebook.
ja: それは Facebook で書かれた製品のニーズによって推進されています。

source: While it is influenced by some paradigms that are not yet fully mainstream such as functional programming, staying accessible to a wide range of developers with different skills and experience levels is an explicit goal of the project.
ja: 関数型プログラミングなど、まだ完全には主流になっていない、いくつかのパラダイムによって影響を受けますが、さまざまなスキルや経験レベルを持つ幅広い開発者がアクセスしやすいことがプロジェクトの明確な目標です。

source: If we want to deprecate a pattern that we don't like, it is our responsibility to consider all existing use cases for it and [educate the community about the alternatives](/blog/2016/07/13/mixins-considered-harmful.html) before we deprecate it.
ja: 私たちが好まないパターンを非推奨にしたい場合は非推奨にする前に、既存のすべてのユースケースを検討し、[コミュニティに代替案について教育する](/blog/2016/07/13/mixins-considered-harmful.html)ことが私たちの責任です。

source: If some pattern that is useful for building apps is hard to express in a declarative way, we will [provide an imperative API](/docs/more-about-refs.html) for it.
ja: アプリを構築するのに有用なパターンを宣言的に表現するのが難しい場合は、[命令的な API を提供](/docs/more-about-refs.html)します。

source: If we can't figure out a perfect API for something that we found necessary in many apps, we will [provide a temporary subpar working API](/docs/legacy-context.html) as long as it is possible to get rid of it later and it leaves the door open for future improvements.
ja: 多くのアプリで必要と思われるものに最適な API を見つけられないときは、[一時的な標準未満の作業用 API](/docs/legacy-context.html) を提供します（後で取り除くことが可能で、将来の改善の余地がある場合に限ります）。

source: ### Stability {#stability}
ja: ### 安定性 {#stability}

source: We value API stability.
ja: 私たちは API の安定性を重視しています。

source: At Facebook, we have more than 50 thousand components using React.
ja: Facebook には、React を使った 5 万以上のコンポーネントがあります。

source: Many other companies, including [Twitter](https://twitter.com/) and [Airbnb](https://www.airbnb.com/), are also heavy users of React.
ja: [Twitter](https://twitter.com/) や [Airbnb](https://www.airbnb.com/) を含む他の多くの会社もまた React のヘビーユーザです。

source: This is why we are usually reluctant to change public APIs or behavior.
ja: これが私たちが公開された API や振る舞いを変更することに大抵消極的である理由です。

source: However we think stability in the sense of "nothing changes" is overrated.
ja: しかし、「何も変わらない」という意味での安定性を人々は過大評価している、と私たちは考えます。

source: It quickly turns into stagnation.
ja: それはすぐに停滞に変わってしまいます。

source: Instead, we prefer the stability in the sense of "It is heavily used in production, and when something changes, there is a clear (and preferably automated) migration path."
ja: 代わりに、「本番環境では頻繁に使用され、何かが変わったときには明確な（できれば自動化された）移行方法がある」という意味での安定性を優先します。

source: When we deprecate a pattern, we study its internal usage at Facebook and add deprecation warnings.
ja: あるパターンを非推奨にするときは、Facebook 内部でその使用法を調べ、非推奨警告を追加します。

source: They let us assess the impact of the change.
ja: これにより変化の影響が評価できます。

source: Sometimes we back out if we see that it is too early, and we need to think more strategically about getting the codebases to the point where they are ready for this change.
ja: 変更が時期尚早であり、準備が整うところまでコードベースを持っていくのにさらに戦略的に検討する必要があると分かった場合、変更を差し戻すことがあります。

source: If we are confident that the change is not too disruptive and the migration strategy is viable for all use cases, we release the deprecation warning to the open source community.
ja: 変更があまり破壊的でなく、移行戦略がすべてのユースケースで実行可能であると確信している場合は、非推奨の警告をオープンソースコミュニティに公開します。

source: We are closely in touch with many users of React outside of Facebook, and we monitor popular open source projects and guide them in fixing those deprecations.
ja: 私たちは Facebook 以外の多くの React ユーザと密接に連絡を取り合っており、人気のあるオープンソースプロジェクトを監視し、非推奨警告の修正を手引きしています。

source: Given the sheer size of the Facebook React codebase, successful internal migration is often a good indicator that other companies won't have problems either.
ja: Facebook の React コードベースのサイズが非常に大きいことを考えると、社内での移行が成功することは、他の企業でも問題ないことを示す良い指標となります。

source: Nevertheless sometimes people point out additional use cases we haven't thought of, and we add escape hatches for them or rethink our approach.
ja: それでも、時々人々は私達が考えていなかった新たなユースケースを指摘するため、私たちはそれらのための避難ハッチを追加したり、アプローチを再考したりします。

source: We don't deprecate anything without a good reason.
ja: 正当な理由がない限り、私たちは何も非推奨にすることはありません。

source: We recognize that sometimes deprecations warnings cause frustration but we add them because deprecations clean up the road for the improvements and new features that we and many people in the community consider valuable.
ja: 非推奨警告は時々イライラさせられるということを認識していますが、それを追加するのは、私たちとコミュニティの多くの人々が価値あると考える改善と新機能追加のための道が、非推奨化によって開かれるからです。

source: For example, we added a [warning about unknown DOM props](/warnings/unknown-prop.html) in React 15.2.0.
ja: たとえば、React 15.2.0 で[未知の DOM props に関する警告](/warnings/unknown-prop.html)を追加しました。

source: Many projects were affected by this.
ja: 多くのプロジェクトがこの影響を受けました。

source: However fixing this warning is important so that we can introduce the support for [custom attributes](https://github.com/facebook/react/issues/140) to React.
ja: しかしこの警告を修正することは、React に[カスタム属性](https://github.com/facebook/react/issues/140)のサポートを導入できるようにするために重要でした。

source: There is a reason like this behind every deprecation that we add.
ja: 私たちが追加するすべての非推奨化の背景には、このような理由があります。

source: When we add a deprecation warning, we keep it for the rest of the current major version, and [change the behavior in the next major version](/blog/2016/02/19/new-versioning-scheme.html).
ja: 非推奨警告を追加すると、現在のメジャーバージョンの残りの部分では警告のまま残り、[次のメジャーバージョンでは動作が変更](/blog/2016/02/19/new-versioning-scheme.html)されます。

source: If there is a lot of repetitive manual work involved, we release a [codemod](https://www.youtube.com/watch?v=d0pOgY8__JM) script that automates most of the change.
ja: 繰り返し行われる手作業が多い場合は、変更の大部分を自動化する [codemod](https://www.youtube.com/watch?v=d0pOgY8__JM) スクリプトをリリースします。

source: Codemods enable us to move forward without stagnation in a massive codebase, and we encourage you to use them as well.
ja: Codemod を使用すると、大規模なコードベースでも移行を滞りなく進めることができます。それらを使用することをお勧めします。

source: You can find the codemods that we released in the [react-codemod](https://github.com/reactjs/react-codemod) repository.
ja: 私たちがリリースした codemod は、[react-codemod](https://github.com/reactjs/react-codemod) リポジトリで見つけることができます。

source: ### Interoperability {#interoperability}
ja: ### 相互運用性 {#interoperability}

source: We place high value in interoperability with existing systems and gradual adoption.
ja: 私たちは既存のシステムとの相互運用性と段階的な導入に高い価値を置いています。

source: Facebook has a massive non-React codebase.
ja: Facebook は巨大な非 React のコードベースを持っています。

source: Its website uses a mix of a server-side component system called XHP, internal UI libraries that came before React, and React itself.
ja: Facebook の Web サイトでは、XHP と呼ばれるサーバサイドのコンポーネントシステム、React よりも前に開発された内部 UI ライブラリ、そして React 自体を組み合わせて使用​​しています。

source: It is important to us that any product team can [start using React for a small feature](https://www.youtube.com/watch?v=BF58ZJ1ZQxY) rather than rewrite their code to bet on it.
ja: 私たちにとって重要なことは、どの製品チームでも、賭けるようにコードを書き換えるのではなく、[小さな機能に対して React を使い始める](https://www.youtube.com/watch?v=BF58ZJ1ZQxY)ことができるということです。

source: This is why React provides escape hatches to work with mutable models, and tries to work well together with other UI libraries.
ja: これが、React がミュータブルなモデルを扱うための避難ハッチを提供し、他の UI ライブラリと一緒にうまく機能しようとする理由です。

source: You can wrap an existing imperative UI into a declarative component, and vice versa.
ja: 既存の命令的な UI を宣言型コンポーネントにラップすることも、その逆も可能です。

source: This is crucial for gradual adoption.
ja: これは段階的な採用には不可欠です。

source: ### Scheduling {#scheduling}
ja: ### スケジューリング {#scheduling}

source: Even when your components are described as functions, when you use React you don't call them directly.
ja: コンポーネントが関数として記述されていても、React を使うときはそれらを直接呼び出さないでください。

source: Every component returns a [description of what needs to be rendered](/blog/2015/12/18/react-components-elements-and-instances.html#elements-describe-the-tree), and that description may include both user-written components like `<LikeButton>` and platform-specific components like `<div>`.
ja: すべてのコンポーネントは[何をレンダーする必要があるかの説明書き](/blog/2015/12/18/react-components-elements-and-instances.html#elements-describe-the-tree)を返し、その説明書きには `<LikeButton>` のようなユーザ作成のコンポーネントと `<div>` のようなプラットフォーム固有のコンポーネントの両方を含めることができます。

source: It is up to React to "unroll" `<LikeButton>` at some point in the future and actually apply changes to the UI tree according to the render results of the components recursively.
ja: 将来のある時点で `<LikeButton>` を「展開」して、コンポーネントのレンダー結果に従って UI ツリーを実際に再帰的に変更するのは、React の責務です。

source: This is a subtle distinction but a powerful one.
ja: これは微妙な違いですが強力なものです。

source: Since you don't call that component function but let React call it, it means React has the power to delay calling it if necessary.
ja: あなたがコンポーネント関数を呼び出さずに React が呼び出します。それは React は必要に応じて呼び出しを遅らせる権限があるということを意味します。

source: In its current implementation React walks the tree recursively and calls render functions of the whole updated tree during a single tick.
ja: 現在の React の実装ではツリーを再帰的に調べて、1 回のイベントループの間に更新されたツリー全体のレンダー関数を呼び出します。

source: However in the future it might start [delaying some updates to avoid dropping frames](https://github.com/facebook/react/issues/6170).
ja: しかし、将来的には[フレームのドロップを避けるため](https://github.com/facebook/react/issues/6170)にいくつかの更新を遅らせるかもしれません。

source: This is a common theme in React design.
ja: これは React の設計の共通テーマです。

source: Some popular libraries implement the "push" approach where computations are performed when the new data is available.
ja: いくつかの人気のあるライブラリは、新しいデータが利用可能になったときに計算が実行される「プッシュ」アプローチを実装しています。

source: React, however, sticks to the "pull" approach where computations can be delayed until necessary.
ja: しかし React は、計算が必要になるまで遅らせることができる「プル」アプローチを採用しています。

source: React is not a generic data processing library.
ja: React は汎用的なデータ処理ライブラリではありません。

source: It is a library for building user interfaces.
ja: ユーザインターフェイスを構築するためのライブラリです。

source: We think that it is uniquely positioned in an app to know which computations are relevant right now and which are not.
ja: アプリ内において React は、どの計算が今すぐ必要でどの計算がそうでないのかを知ることができる特殊な位置づけにある、と私たちは考えています。

source: If something is offscreen, we can delay any logic related to it.
ja: 何かが画面外にある場合は、それに関連するロジックを遅らせることができます。

source: If data is arriving faster than the frame rate, we can coalesce and batch updates.
ja: データがフレームレートよりも早く到着する場合は、合体してバッチ更新することができます。

source: We can prioritize work coming from user interactions (such as an animation caused by a button click) over less important background work (such as rendering new content just loaded from the network) to avoid dropping frames.
ja: フレームを落とさないように、重要度の低いバックグラウンド作業（ネットワークからロードされたばかりの新しいコンテンツのレンダーなど）よりも、ユーザの操作による操作（ボタンクリックによるアニメーションなど）を優先できます。

source: To be clear, we are not taking advantage of this right now.
ja: 念のために言うと、今の時点ではこれらの可能性は実現していません。

source: However the freedom to do something like this is why we prefer to have control over scheduling, and why `setState()` is asynchronous.
ja: しかし、このようなことを自由に行いたいということが、私たちがスケジューリングを制御したい理由であり、`setState()` が非同期である理由です。

source: Conceptually, we think of it as "scheduling an update".
ja: 概念的には、`setState()` を「更新のスケジュール」だと考えています。

source: The control over scheduling would be harder for us to gain if we let the user directly compose views with a "push" based paradigm common in some variations of [Functional Reactive Programming](https://en.wikipedia.org/wiki/Functional_reactive_programming).
ja: ユーザが[関数型リアクティブプログラミング](https://en.wikipedia.org/wiki/Functional_reactive_programming)のいくつかのバリエーションで一般的な「プッシュ」ベースのパラダイムでビューを直接構成させた場合、スケジューリングに対する制御を得るのが難しくなります。

source: We want to own the "glue" code.
ja: 「糊付け部分」のコードは私たちが管理したいのです。

source: It is a key goal for React that the amount of the user code that executes before yielding back into React is minimal.
ja: React の主な目標は、React 内部に戻る前に実行されるユーザコードの量を最小限にすることです。

source: This ensures that React retains the capability to schedule and split work in chunks according to what it knows about the UI.
ja: これは React が UI について知っていることに従ってスケジュールしたり小分けに作業を分割したりする能力を保持することを保証します。

source: There is an internal joke in the team that React should have been called "Schedule" because React does not want to be fully "reactive".
ja: React は完全に「リアクティブ」であることを望んでいないため、React は "Schedule" と呼ばれるべきだったというチーム内の冗談があります。

source: ### Developer Experience {#developer-experience}
ja: ### 開発体験 {#developer-experience}

source: Providing a good developer experience is important to us.
ja: 良い開発者経験を提供することは私達にとって重要です。

source: For example, we maintain [React DevTools](https://github.com/facebook/react/tree/main/packages/react-devtools) which let you inspect the React component tree in Chrome and Firefox.
ja: たとえば、Chrome と Firefox で React コンポーネントツリーを調べることができる [React DevTools](https://github.com/facebook/react/tree/master/packages/react-devtools) をメンテしています。

source: We have heard that it brings a big productivity boost both to the Facebook engineers and to the community.
ja: 私たちは、それが Facebook エンジニアとコミュニティの両方に大きな生産性向上をもたらしていると聞いています。

source: We also try to go an extra mile to provide helpful developer warnings.
ja: 私たちは開発者向けの有用な警告を提供するために、一層の努力をするようにしています。

source: For example, React warns you in development if you nest tags in a way that the browser doesn't understand, or if you make a common typo in the API.
ja: たとえば、React は開発中にブラウザが理解できない方法でタグをネストした場合、または API で一般的な入力ミスをした場合に警告します。

source: Developer warnings and the related checks are the main reason why the development version of React is slower than the production version.
ja: 開発者向けの警告とそれに関連するチェックが、React の開発版が製品版より遅い主な理由です。

source: The usage patterns that we see internally at Facebook help us understand what the common mistakes are, and how to prevent them early.
ja: Facebook で内部的に見られる使用パターンは、よくある間違いとは何か、そしてそれらを早期に防ぐ方法を理解するのに役立ちます。

source: When we add new features, we try to anticipate the common mistakes and warn about them.
ja: 私たちが新しい機能を追加するとき、私たちはよくある間違いを予想してそれらについて警告しようとします。

source: We are always looking out for ways to improve the developer experience.
ja: 私たちは開発者の体験を向上させる方法を常に探しています。

source: We love to hear your suggestions and accept your contributions to make it even better.
ja: 体験をさらに良くするために、ぜひ皆さんの提案を聞き、貢献を受け入れたいと思っています。

source: ### Debugging {#debugging}
ja: ### デバッグ {#debugging}

source: When something goes wrong, it is important that you have breadcrumbs to trace the mistake to its source in the codebase.
ja: 問題が発生した場合は、コードベースでその間違いの原因を突き止めるための "パンくず" (breadcrumb) を作成することが重要です。

source: In React, props and state are those breadcrumbs.
ja: React では、props と state がそのようなパンくずです。

source: If you see something wrong on the screen, you can open React DevTools, find the component responsible for rendering, and then see if the props and state are correct.
ja: 画面に問題がある場合は、React DevTools を開いてレンダーを担当するコンポーネントを見つけ、次に props と state が正しいかどうかを確認できます。

source: If they are, you know that the problem is in the component’s `render()` function, or some function that is called by `render()`.
ja: そうであれば、問題はコンポーネントの `render()` 関数、または `render()` によって呼び出される関数にあることがわかります。

source: The problem is isolated.
ja: これで問題が切り分けられました。

source: If the state is wrong, you know that the problem is caused by one of the `setState()` calls in this file.
ja: state が間違っている場合、問題はこのファイル内の `setState()` の呼び出しの 1 つによって引き起こされていることがわかります。

source: This, too, is relatively simple to locate and fix because usually there are only a few `setState()` calls in a single file.
ja: これも、通常は 1 つのファイル内に `setState()` の呼び出しは数回しかないため、検索と修正が比較的簡単です。

source: If the props are wrong, you can traverse the tree up in the inspector, looking for the component that first "poisoned the well" by passing bad props down.
ja: props が間違っている場合は、インスペクタでツリーを上にたどり、悪い props を渡して最初に「井戸に毒を入れた」犯人のコンポーネントを探します。

source: This ability to trace any UI to the data that produced it in the form of current props and state is very important to React.
ja: 任意の UI を生成した元データまで props と state の現在値を使って追跡できるというこの能力は React にとって非常に重要です。

source: It is an explicit design goal that state is not "trapped" in closures and combinators, and is available to React directly.
ja: state がクロージャやコンビネータに「閉じ込め」られておらず、React で直接利用できることは明示的な設計目標です。

source: While the UI is dynamic, we believe that synchronous `render()` functions of props and state turn debugging from guesswork into a boring but finite procedure.
ja: UI は動的ですが、props と state の同期的な `render()` 関数により、デバッグ作業が単なる当て推量から、退屈ながら有限の手順になると信じています。

source: We would like to preserve this constraint in React even though it makes some use cases, like complex animations, harder.
ja: これにより複雑なアニメーションのようないくつかのユースケースがより困難になりますが、React ではこの制約を保持したいと思います。

source: ### Configuration {#configuration}
ja: ### 設定 {#configuration}

source: We find global runtime configuration options to be problematic.
ja: グローバルな実行時設定オプションは問題があることがわかりました。

source: For example, it is occasionally requested that we implement a function like `React.configure(options)` or `React.register(component)`.
ja: 例えば、`React.configure(options)` や `React.register(component)` のような関数を実装することが時々要求されます。

source: However this poses multiple problems, and we are not aware of good solutions to them.
ja: しかし、これは複数の問題を引き起こし、私たちはそれらに対する良い解決策を知りません。

source: What if somebody calls such a function from a third-party component library?
ja: 誰かがサードパーティのコンポーネントライブラリからそのような関数を呼び出すとどうなりますか？

source: What if one React app embeds another React app, and their desired configurations are incompatible?
ja: ある React アプリに別の React アプリが埋め込まれていて、それらの望ましい設定に互換性がない場合はどうなりますか？

source: How can a third-party component specify that it requires a particular configuration?
ja: サードパーティコンポーネントは特定の設定をどのように必須にしますか？

source: We think that global configuration doesn't work well with composition.
ja: グローバル設定はコンポジションではうまく機能しないと考えています。
